{"config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 374], "trainable": true, "mask_zero": false, "output_dim": 16, "embeddings_constraint": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 200, "dtype": "float32", "embeddings_regularizer": null, "name": "embedding_1", "input_length": 374}, "class_name": "Embedding"}, {"config": {"strides": [1], "activity_regularizer": null, "filters": 128, "bias_regularizer": null, "trainable": true, "dilation_rate": [1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "padding": "same", "name": "conv1d_1", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"strides": [1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "padding": "same", "name": "conv1d_2", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "name": "max_pooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"strides": [1], "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "padding": "same", "name": "conv1d_3", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "name": "max_pooling1d_3"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 500, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.0, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 2, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Sequential"}