{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 118], "dtype": "float32", "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "output_dim": 100, "input_length": 118, "activity_regularizer": null, "input_dim": 691198, "name": "embedding_1", "embeddings_constraint": null, "embeddings_regularizer": null, "trainable": false}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3], "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv1d_1", "trainable": true, "filters": 256}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3], "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv1d_2", "trainable": true, "filters": 128}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_size": [3], "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv1d_3", "trainable": true, "filters": 64}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 180, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "units": 1, "trainable": true}}]}